[
    {
        "title": "Match Thread: 3rd T20I - England vs West Indies",
        "selftext": "###3rd T20I, West Indies tour of England at Southampton\n\n[Cricinfo](http://www.espncricinfo.com/series/1448331/game/1448348/) | [Reddit-Stream](https://reddit-stream.com/comments/1l82i6x/)\n\n\n\n\n**Please upvote for visibility, you cowards!**\n\n[^(App feedback)](https://www.reddit.com/user/poochi/comments/1iuet65/cricketmatch_bot_known_issues/) ^|\n    [^(Schedule)](https://www.reddit.com/r/Cricket/wiki/match_schedule) ^|\n    [^(Glossary)](https://www.reddit.com/r/Cricket/wiki/glossary)",
        "url": "https://www.reddit.com/r/Cricket/comments/1l82i6x/match_thread_3rd_t20i_england_vs_west_indies/",
        "score": 9,
        "id": "1l82i6x",
        "comments": [
            {
                "body": "Eh",
                "score": 1,
                "id": "mx1h2xq"
            }
        ]
    },
    {
        "title": "COURTNEY WALSH INTERVIEW: How West Indies can get back on top - in just two years",
        "selftext": "",
        "url": "https://www.dailymail.co.uk/sport/cricket/article-14793773/Courtney-Walsh-West-Indies-David-Syd-Lawrence.html",
        "score": 5,
        "id": "1l7w63r",
        "comments": [
            {
                "body": "That's not quite what he said. Not an atypical circumstance for the *Daily Mail*. He is saying that he hopes the West Indies can be a top 4 side, that the commitment to cricket is there and that with a some domestic restructuring and major international financial restructuring, there is some hope.",
                "score": 8,
                "id": "mx19pyd"
            },
            {
                "body": "[Article behind the paywall](https://archive.is/20250609193933/https://www.dailymail.co.uk/sport/cricket/article-14793773/Courtney-Walsh-West-Indies-David-Syd-Lawrence.html)",
                "score": 3,
                "id": "mwzxbsp"
            },
            {
                "body": "I started watching cricket in 1996 world cup when Windies were 2 time wc champions. They became my instant favourites. I remember the shock defeat to Kenya, that chase againt Australia in league, a brilliant Lara 111 against SA in qf. I also remember like yesterday the anguish of wc semi when Windies had Australia at 15 for 4, were 165 for 2 in pursuit of 207, and then still managed to fold. Sir Richie Richardson was at the not striker end when Walsh was bowled, I remember the agony. If they made finals, anything could have happened. That was sadly the last time they made a 50 over wc semi.\n\nWhat followed has not exactly been a joyride. Not even one 50 over ICC world cup or test championship of substance. Two t20 wc, finals of 1998 knockout, 2004 ct win, and 2006 ct finals have brought some joy. Players have come and gone. Ian Bishop injuries cut his career short in 1998, promising players not going full distance like Franklyn Rose, Reon King, Merv Dillon, Jermaine Lawson, Wavell Hinds, Sarwan (I still believe he could have gone even farther), Darren Bravo, now Pooran.\n\nI just hope that they get back to winning ways. The decline happened over several years, so I don't expect the recovery to happen overnight either. First, the qualification in big tournaments needs to happen. The longer they miss out, the gulf would widen between them and the top teams. The talent is there for sure. I have seen their domestic 50 over matches. The execution needs to be top notch. I would be a very happy and relieved fan if I see Windies rise again.",
                "score": 1,
                "id": "mx1gjqj"
            }
        ]
    },
    {
        "title": "Travelling to Australia to see a match?",
        "selftext": "I was thinking of travelling to Australia so in October and seeing IND vs AUS in Sydney. \nHas anyone done it before? I would love to hear your experiences. \nIt will be a solo trip as I have few friends and no one will probably come with me on this trip.",
        "url": "https://www.reddit.com/r/Cricket/comments/1l7wnkj/travelling_to_australia_to_see_a_match/",
        "score": 5,
        "id": "1l7wnkj",
        "comments": []
    },
    {
        "title": "Proteas pinpoint Australia's weakness ahead of WTC25 Final",
        "selftext": "",
        "url": "https://www.icc-cricket.com/news/south-africa-pinpoint-australia-s-weakness-ahead-of-wtc25-final",
        "score": 12,
        "id": "1l81h6a",
        "comments": [
            {
                "body": "In before marnus has his name on the honours board.",
                "score": 9,
                "id": "mx1czmp"
            },
            {
                "body": "The only thing in favor of South Africans is that no reasonably experienced and knowledgeable cricket fan will expect anything positive from them. They can play without fear.\n\nI doubt even South African fans expect a victory realistically.",
                "score": 8,
                "id": "mx1ficd"
            },
            {
                "body": "If labs opening the batting is the only weakness they can exploit surely that's a bit worrying for SA.",
                "score": 14,
                "id": "mx18z9l"
            },
            {
                "body": "It's marnus we know",
                "score": 7,
                "id": "mx19shd"
            },
            {
                "body": "Don’t care, our slip cordon alone will eat South Africa alive",
                "score": 5,
                "id": "mx1f69l"
            }
        ]
    },
    {
        "title": "Temba Bavuma on why Lungi Ngidi has been picked in South Africa's XI for the WTC final over Dane Paterson",
        "selftext": "",
        "url": "https://i.redd.it/21swkoq2846f1.jpeg",
        "score": 28,
        "id": "1l8157l",
        "comments": [
            {
                "body": "Bavuma talking about physical heights, hmmmm...",
                "score": 24,
                "id": "mx1c8ts"
            },
            {
                "body": "Man! I hope they are right. Why would they bench a form player is beyond me. Did they learn nothing from 2015 SF? I won’t be able to handle another AUS win. \n\nNgidi, feel free to shove my foot in my mouth. Please and Thank you.",
                "score": 12,
                "id": "mx1b7i8"
            },
            {
                "body": "\"Taller as well\"\n\nBaz will be so proud of you Temba.",
                "score": 12,
                "id": "mx1daae"
            },
            {
                "body": "I'm skeptical of Ngidi. But if he gets just a little swing in the English conditions, he will be unplayable",
                "score": 4,
                "id": "mx1fp67"
            },
            {
                "body": "Height thing making a room in Bavuma's subconscious.",
                "score": 4,
                "id": "mx1hwel"
            }
        ]
    },
    {
        "title": "A fine career in the West Indies maroon comes to a close",
        "selftext": "",
        "url": "https://i.redd.it/gyhlkwpe546f1.jpeg",
        "score": 48,
        "id": "1l80rd6",
        "comments": [
            {
                "body": "Pooran playing more T20Is than Gayle feels kinda weird ngl",
                "score": 36,
                "id": "mx1aia2"
            },
            {
                "body": "I have no emotions about this because if I try to I will probably have a stroke.",
                "score": 23,
                "id": "mx19zro"
            },
            {
                "body": "LOL that strike rate is much lower than I thought.",
                "score": 9,
                "id": "mx1h576"
            },
            {
                "body": "As a 30 year long Windies fan, I look forward to at least some good news. They are having a horror time in England, and hours ago, I saw Pooran retirement.",
                "score": 4,
                "id": "mx1hful"
            },
            {
                "body": "Who is 3rd?",
                "score": 1,
                "id": "mx1hzgq"
            }
        ]
    },
    {
        "title": "Assam Cricket Association to Tour Nambia for Five 50 Over Matches",
        "selftext": "",
        "url": "https://i.redd.it/5o2o098v846f1.jpeg",
        "score": 101,
        "id": "1l819et",
        "comments": [
            {
                "body": "Wow. This is an incredible initiative. Would be good exposure for both the sides.\n\n\nCricket in Namibia has been around for very long. They were a part of 2003 world cup. It is about time they really ramp it up. Would be great overseas exposure for Assam team too.",
                "score": 48,
                "id": "mx13yla"
            },
            {
                "body": "Damm never imagined such an initiative, hope we get it's coverage on YouTube or jio",
                "score": 20,
                "id": "mx16x5d"
            },
            {
                "body": "Beautiful. Makes me happy.",
                "score": 14,
                "id": "mx15j63"
            },
            {
                "body": "Is Parag captaining the Assam side?",
                "score": 11,
                "id": "mx17p9t"
            },
            {
                "body": "Parag is going to assert dominance by scoring 500 runs and taking 25 wickets.",
                "score": 11,
                "id": "mx1a51h"
            }
        ]
    },
    {
        "title": "WTC Final: Interview between Ravi Shastri and Pat Cummins",
        "selftext": "Yesterday before the ICC Hall of Fame ceremony started, Ravi Shastri sat down with captains Temba Bavuma and Pat Cummins ahead of the World Test Championship Final. Below is the full interview transcript between Ravi and Pat.\n\n\n\nhttps://preview.redd.it/killj4hmy36f1.png?width=720&format=png&auto=webp&s=8132694a9d5a3ad5bc916dfa4d4f1c023be8d07f\n\n**Ravi Shastri:** Pat Cummins, you’ve been through a long journey. It’s your second final as a World Test Championship captain. You started against South Africa at 18 years of age. Ten years down the line, you’re the first Australian fast bowler to be made a permanent captain.\n\n**Pat Cummins:** Good day, Ravi. Good day, everyone. It’s pretty crazy. Every now and then, the footage comes up and I feel and look like I was a kid. I think Graeme Smith was playing in that Test match as well, which, you know, are guys that I grew up watching. Jacques Kallis played alongside Ricky Ponting and some of the greats in the game. In that Test match, which feels a long time ago to me, so it’s pretty sweet that I still get to do this.\n\n**Ravi Shastri:** Now the fact that you’ve already been in a World Test Championship final, and you’re the holders, will that make a difference? You’re with a bunch of fast bowlers that we rate among the best of all time. When you actually look at your attack, add Nathan Lyon there, there’s one bloke sitting at 500 wickets. There’s another sitting on either side of 300 and then there’s Scotty Boland. It’s a nice place to be.\n\n**Pat Cummins:** It is. *(looks to crowd)* Sorry Hashim, forgot you also played there. I think he got a 100 as well, maybe that’s why I forgot it. You know, we’re in a really good spot at the moment. We’ve been really lucky the last 4 or 5 years. Some of the all-time greats have all hit their peak at the same time. Starcy is on the verge of playing 100 Test matches. Lyon is almost at 500 wickets. Hoff and Boland always seem to be taking wickets whenever they play. It’s really lucky that it’s in a sweet spot but we also have a lot of fun. The last couple of years have been some of the most enjoyable of any of our lives so hopefully it keeps rolling on.\n\n**Ravi Shastri:** Well, Pat, for you, a lot more surreal. 19 matches in that cycle, 13 wins, but you still had to do the job. Game after game.\n\n**Pat Cummins:** Yeah, that’s right. You never feel quite safe. I think winning against New Zealand at their home was a big series win for us. We kind of just won that second Test match. That put us in a really good place. A win away from home is one of the beauties about this competition. Then, of course, India at home, 5 Test matches. Lost the first one but the way that we wrestled that back, I think was huge for this group. Secured our place by the end of that series and then the boys, I wasn’t there, went on to do the job in Sri Lanka which is a really tough feat as well, going over there and winning.\n\n**Ravi Shastri:** When you look at your road to the final, you won it quite easily. Did you ever think you were in a spot of bother?\n\n**Pat Cummins:** You know, we always put where we are on the board in team meetings. We’re always thereabouts but you know that you have to be consistent across all 6 series. I think our over rates were pretty poor in one of the Tests, that didn’t do us any favours as well. As I said, that New Zealand win and then kind of bouncing back after the Perth loss against India, we felt pretty confident.\n\n**Ravi Shastri:** And Pat, a few air miles for your players as well. You got Steve Smith living in the United States. He’s not played a lot of cricket. A lot of your boys playing in the IPL. Some flying back to Australia then coming back to England. What’s it been like?\n\n**Pat Cummins:** Good thing Steve Smith has been doing some workouts in New York, making sure everyone sees it on Instagram but he’s ready. One of our strengths as a group is everyone’s got different things going on but we try and make it all work. Some guys came from IPL, both Inglis and Hazlewood came in late, they played in the final. A few guys played county cricket and, of course, a few bowlers back home were working away together in Brisbane for a week or two before heading out here. Preparation has been great. Everyone was excited to see everyone again after a couple of months away. At practice, it was as high intensity as I’ve seen from the boys in a long time. Me included. The boys seem ready to go.\n\n**Ravi Shastri:** Pat, you are the senior pro. Second time in this final. A chance of lifting the trophy again. What would your message be to youngsters? Because it’s a long journey and you speak for yourself, you had an injury and were out for a long time. What’s it like to break barriers? Fight all odds?\n\n**Pat Cummins:** Test cricket is the most fulfilling format because there are always setbacks. Even if you win a Test comfortably, you still walk off the field feeling like you’re physically depleted. It takes a lot out of you. I just think as a format, it tests you in so many different ways. The beauty of the competition like this is you get to play overseas. Now we’re playing South Africa at a neutral venue with the Duke’s ball, it’s totally different. You don’t really see that in other formats. So I’d just encourage everyone to keep plugging away, keep trying. You know it’s really fulfilling when you taste some success in Test cricket.\n\n**Ravi Shastri:** You’re the Mr. Nice Guy, Pat Cummins, but that’s off the field. When you’re sitting here, only the guys who have played you out in the middle know otherwise. What’s the legacy you want to leave behind for Australia? As captain, as player.\n\n**Pat Cummins:** It’s not really something I think about too much. I’m just really focused on how I want the team to feel right now. That’s really wanting everyone to feel that they could be themselves. I think that’s shown over the last couple of years. People can walk out on the field and be backed similarly to how they are off the field. That’s freedom. That helps people to play their best cricket. The fans back home seem to enjoy that, seeing some of the quirky personalities in our team really shine. Maybe that’s something that I get remembered by and that’s only a good thing.",
        "url": "https://www.reddit.com/r/Cricket/comments/1l7ztth/wtc_final_interview_between_ravi_shastri_and_pat/",
        "score": 36,
        "id": "1l7ztth",
        "comments": [
            {
                "body": "Do the ICC even lock down interviews with players so folk have to read transcripts? Utterly embarrassing shite.",
                "score": 10,
                "id": "mx10vwv"
            },
            {
                "body": "This Pat Cummins dude sounds alright.",
                "score": 13,
                "id": "mx0t4dr"
            },
            {
                "body": "\n>**Ravi Shastri:** You’re the Mr. Nice Guy, Pat Cummins, but that’s off the field. When you’re sitting here, only the guys who have played you out in the middle know otherwise. What’s the legacy you want to leave behind for Australia? As captain, as player.\n\n>**Pat Cummins:** It’s not really something I think about too much. I’m just really focused on how I want the team to feel right now. That’s really wanting everyone to feel that they could be themselves. I think that’s shown over the last couple of years. People can walk out on the field and be backed similarly to how they are off the field. That’s freedom. That helps people to play their best cricket. The fans back home seem to enjoy that, seeing some of the quirky personalities in our team really shine. Maybe that’s something that I get remembered by and that’s only a good thing.\n\nOn some level, it might definitely be his personality that people will remember him by. Obviously his stats are also great, but when u think back abt him as a player and captain, his personality shines through.",
                "score": 11,
                "id": "mx0van7"
            },
            {
                "body": "[WTC Final: Interview between Ravi Shastri and Temba Bavuma](https://www.reddit.com/r/Cricket/comments/1l7w44v/wtc_final_interview_between_ravi_shastri_and/)",
                "score": 6,
                "id": "mx0qqul"
            },
            {
                "body": "Really admire the bowling lineup of Aussies. Battle hardened, consistently bowling 140+ on hard surfaces over after over. Mind you they are not spring chickens. Then you got Lyon closing in 500 sticks !! Absolute legendary. Really excited to see them perform in BGT in India.\nAll the best to both teams for WTC finals.",
                "score": 2,
                "id": "mx1he06"
            }
        ]
    },
    {
        "title": "Ashwin punished for outburst at umpires, hitting his pads and throwing gloves in the air in TNPL match",
        "selftext": "",
        "url": "https://www.hindustantimes.com/cricket/ashwin-punished-for-outburst-at-umpires-hitting-his-pads-and-throwing-gloves-in-the-air-in-tnpl-match-101749518849190.html",
        "score": 164,
        "id": "1l7w31u",
        "comments": [
            {
                "body": "Was never ready for ash anna villian arc",
                "score": 163,
                "id": "mx0qqq0"
            },
            {
                "body": "He shouted ,' Do you know I am?. Wait until Thala hears about this' and the umpires apologized..",
                "score": 90,
                "id": "mx0xvqw"
            },
            {
                "body": "The decision was a howler. He had every right to be disappointed with the decision.\n\nBut you don’t get to retire from international cricket so that you can play some bush league without DRS, and then throw a tantrum when you get a bad umpiring decision.\n\nEdit: I’ve since learned that DRS was in play. But the reviews had been wasted. Just makes it even more funny in my opinion.",
                "score": 112,
                "id": "mx0sh0k"
            },
            {
                "body": "I think it is fair to say the last few months haven't been great for our ethical anna.",
                "score": 18,
                "id": "mx13q7q"
            },
            {
                "body": "Ethical Rage",
                "score": 19,
                "id": "mx0rhlq"
            }
        ]
    },
    {
        "title": "Australia announce their XI for the World Test Championship final",
        "selftext": "",
        "url": "https://i.redd.it/bcjkogzgd36f1.jpeg",
        "score": 670,
        "id": "1l7x7a0",
        "comments": [
            {
                "body": "Look, I don’t expect much from Marnus to be honest, but if he can blunt Rabada and Jansen with the new ball for 10 overs then I’ll say job well done lol.",
                "score": 263,
                "id": "mx05x3r"
            },
            {
                "body": "2(43) in the first hour.",
                "score": 306,
                "id": "mx05v8t"
            },
            {
                "body": "Expected XI, but huge pressure on Green at 3 - has he ever played there in internationals?",
                "score": 219,
                "id": "mx05n5u"
            },
            {
                "body": "Webster,smith and green!Slips won't drop a single catch.",
                "score": 142,
                "id": "mx05ycv"
            },
            {
                "body": "Green and Webster in third slip and gully will cover the wing span of four men",
                "score": 64,
                "id": "mx07e7c"
            }
        ]
    }
]